{
  "schedule": {
    "conference": {
      "name": "API Conference Lagos 2025",
      "location": "The Zone, Gbagada, Lagos",
      "support_contact": "+2348067169121",
      "website": "https://apiconference.africa/lagos"
    }
  },
  "days": [
    {
      "day": 1,
      "date": "July 18, 2025",
      "sessions": [
        {
          "id": "session_001",
          "title": "From Frustration to Flow: Creating API Documentation Developers Actually Love",
          "description": "In this session, we'll explore how to transform your API documentation from a necessary evil into a powerful developer experience asset. You'll learn the critical elements that separate documentation that gets cursed at from documentation that gets praised, with specific techniques to implement immediately.\n\nWe'll cover:\n\n1. The anatomy of exceptional API documentation: structure, language, and visual elements\n\n2. How to write clear reference material while telling the \"story\" of your API\n\n3. Documentation-driven development: why great docs start before a single line of code (OpenAPI)\n\n4. Testing documentation for accuracy and usability\n\n5. Tools and automation to keep the documentation current and trustworthy\n",
          "speakers": [
            "ce9cdf48-cb8a-4f3c-9168-96bfc4d02f95"
          ],
          "time": "10:00 - 10:15",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Documentation",
            "How",
            "OpenAPI",
            "Testing",
            "Tools"
          ],
          "type": "keynote"
        },
        {
          "id": "session_002",
          "title": "Building to last",
          "description": "Building APIs that can stand the test of time from the ground up.",
          "speakers": [
            "4cebc013-9784-4889-a1f1-23d6cfb4464c"
          ],
          "time": "10:15 - 10:30",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Building"
          ],
          "type": "keynote"
        },
        {
          "id": "session_003",
          "title": "Building APIs on cloudflare",
          "description": "Cloudflare has evolved beyond just a CDN, offering powerful tools for building and deploying APIs at the edge. In this session, we’ll explore how to leverage Cloudflare Workers, KV storage, Durable Objects, and other Cloudflare services to build high-performance, globally distributed APIs.\n\nAttendees will gain insights into designing APIs that are cost-effective, resilient, and optimized for low-latency requests. We’ll also cover best practices for authentication, rate limiting, and caching to ensure security and scalability. Whether you're new to Cloudflare or looking to enhance your existing API infrastructure, this session will provide actionable strategies to help you build APIs that thrive in a cloud-first world.",
          "speakers": [
            "84d9505e-cd27-4c64-88d3-57b4e5ca87d1"
          ],
          "time": "10:35 - 10:45",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Attendees",
            "Cloudflare",
            "Durable",
            "Objects",
            "Whether"
          ],
          "type": "lightning"
        },
        {
          "id": "session_004",
          "title": "Going Multimodal with Agent Development Kit: Personal Expense Assistant with Gemini 2.5, Firestore a",
          "description": "",
          "speakers": [
            "354dda74-4915-49a2-8999-dde7c90de1b6"
          ],
          "time": "10:35 - 11:20",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [],
          "type": "workshop"
        },
        {
          "id": "session_005",
          "title": "API Architecure",
          "description": "Short discuss on common sense architecture for APIs that would optimize performance, scalability, innovation, security, and governance",
          "speakers": [
            "a738497b-82c7-4a8c-a791-b9b70fff6bd0"
          ],
          "time": "10:45 - 10:55",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Short"
          ],
          "type": "lightning"
        },
        {
          "id": "session_006",
          "title": "Autonomous APIs: Can APIs Self-Heal and Self-Optimize?",
          "description": "APIs are evolving into self-optimizing, self-healing intelligent systems powered by AI and automation. They can detect failures, optimize performance in real time, and adapt dynamically to changing traffic patterns. I’ll discuss the key challenges with traditional APIs, how Autonomous APIs are addressing these issues, and how we can start integrating these tools into our work.",
          "speakers": [
            "31b2e7e8-5e69-4c0f-8a16-ab542469c249"
          ],
          "time": "11:20 - 11:45",
          "room": "Amber Hall",
          "level": "intermediate",
          "topics": [
            "Autonomous",
            "They"
          ],
          "type": "session"
        },
        {
          "id": "session_007",
          "title": "Why Your API is Making Frontend Developers’ Lives Harder (And How to Fix It)",
          "description": "APIs are the backbone of modern applications, but too often, they create unnecessary friction for front-end developers. Considerable APIs are designed without considering real-world integration challenges, leading to mismatched data structures, inconsistent responses, over-fetching or under-fetching issues and a general disconnect between what’s built and what’s needed.\n\nAs a result, frontend engineers are forced to act as makeshift QA testers, product managers, and even API negotiators—debugging inconsistencies, requesting endless fixes, and building extra layers of abstraction to make APIs usable. This slows down development, increases frustration, and ultimately impacts user experience.\n\nIn this session, I’ll share insights from my experience as a front-end engineer working closely with APIs, highlighting common pitfalls that make integration difficult. More importantly, I’ll provide actionable strategies for API developers to build intuitive, predictable, and truly frontend-friendly interfaces.\n\nKey takeaways:\n- How poor API design forces frontend developers into unnecessary workarounds\n- The most common API mistakes that create friction in frontend integration\n- Best practices for structuring API responses, ensuring consistency, and reducing over-fetching/under-fetching\n- The role of API contracts, OpenAPI specs, and real-world testing in creating seamless integrations\n- How better collaboration between frontend and backend teams leads to faster development cycles\n\nIf you’re an API developer, product owner, or even a frontend engineer looking to advocate for better APIs, this session will provide the insights and tools needed to bridge the API-frontend gap and build products that work.",
          "speakers": [
            "c002da21-9e37-480c-ae3e-62dbe7f6161c"
          ],
          "time": "11:20 - 11:45",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "Best",
            "Considerable",
            "How",
            "Key",
            "More"
          ],
          "type": "session"
        },
        {
          "id": "session_008",
          "title": "API Engineering at Mono: Scaling Microservices to Handle Millions of Requests per Month",
          "description": "In this practical and insightful talk, we’ll dive into how Mono Financial Services scales and manages multiple microservices to handle millions of API requests each month across its services.\n\nWe’ll explore:\n\n- The infrastructure powering our API systems, primarily built on Kubernetes\n- How we use internal metrics and live error tracking to maintain reliability in production\n- Strategies for managing resource costs and optimizing performance at scale\n- Real-world examples like handling memory-intensive cron jobs and traffic spikes\n\nThis talk will offer a behind-the-scenes look into the engineering decisions that help us stay performant and cost-efficient, and how you can apply these practices when building your high-traffic API systems.\n\nWhether you’re building your first distributed system or scaling existing services, you’ll leave with actionable insights from our production experience.",
          "speakers": [
            "5c7ba387-f767-4a95-833e-af3ac1a8d3da"
          ],
          "time": "11:20 - 11:45",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Financial",
            "How",
            "Kubernetes",
            "Mono",
            "Real"
          ],
          "type": "session"
        },
        {
          "id": "session_009",
          "title": " Building an AI Documentation Agent for Your API using RAG",
          "description": "Transform your API codebase into an interactive AI agent using Retrieval-Augmented Generation (RAG). This talk explores how to tokenize your entire codebase, understand function behaviors and API endpoints, and create a conversational interface that lets developers chat with your documentation.\nWe'll examine:\n\n- Converting functions, endpoints, and their implementations into a RAG-ready knowledge base\n- Techniques for accurate code tokenization and embedding\n- Building an intelligent agent that understands your API's domain context\n- Architecture for integrating RAG with your existing documentation\n- Strategies for handling code updates and maintaining documentation accuracy\n\nThe session details practical strategies for creating an AI documentation agent that can explain your API's functionality, describe endpoints, and provide contextual insights about your codebase.\nTarget Audience:\n\n- Developer Experience Engineers\n- API Platform Teams\n- Backend Developers\n- Documentation Maintainers",
          "speakers": [
            "36433464-33e6-4341-88af-b6cf56cf1357"
          ],
          "time": "11:45 - 12:30",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Architecture",
            "Audience",
            "Augmented",
            "Backend",
            "Building"
          ],
          "type": "workshop"
        },
        {
          "id": "session_010",
          "title": "API Specifications: Open Banking Specification",
          "description": "Session Objectives\n1. What is Open Banking\n2. Benefits of Open Banking\n3. Open Banking API Specifications \n4. Security Specifications in Open Banking\n5. Implementation and Best Practices\n6. Sample Use cases\n7. Questions and Answers\n\nThe Audience will:\n1. Understand the core concepts and benefits of Open Banking.\n2. Gain an understanding of Open Banking API specifications.\n3. Learn how to implement and work with Open Banking APIs.\n4. Explore security considerations and best practices.\n5. See real-world use cases and the future of Open Banking\n",
          "speakers": [
            "de6665dd-1fd4-4037-8084-e625bbba490c"
          ],
          "time": "11:45 - 12:30",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "Answers",
            "Audience",
            "Banking",
            "Benefits",
            "Best"
          ],
          "type": "workshop"
        },
        {
          "id": "session_011",
          "title": "Getting Your OpenAPI Spec Ready for Code Generation",
          "description": "Last year, we explored how to design and document APIs with OpenAPI. This year, we’re going a step further—into the world of code generation.\n\nIn this advanced session, we’ll show you how to evolve your OpenAPI specs from static descriptions into powerful, reusable assets that generate SDKs, server stubs, tests, and more. But to get clean, usable code, your spec needs more than just endpoints—it needs structure, consistency, and intention.\n\nAttendees will learn how to:\n\n- Refactor your specs for codegen success (think: reusable components, enums, type safety)\n\n- Avoid common pitfalls like vague schemas, circular refs, or overloaded responses\n\n- Enforce consistency with style guides and automated linting\n\n- Integrate your specs into CI/CD pipelines for validation and governance\n\n- Generate tailored docs, SDKs, and test clients—automatically\n\n- Balance automation vs control: When to let the generator do the work—and when to intervene\n\nWe’ll demo code generation tools in action (like OpenAPI Generator, NSwag, and Stoplight), and share real-world lessons from teams using OpenAPI across production systems. You’ll also get practical tips for integrating codegen into your API lifecycle and CI/CD workflows.\n\nThis session is perfect for developers, architects, and technical writers ready to take their OpenAPI game to the next level—turning documentation into real, usable code.",
          "speakers": [
            "c8f78748-06b6-4210-ae7a-634fcc90fb2d"
          ],
          "time": "11:45 - 12:30",
          "room": "Amber Hall",
          "level": "advanced",
          "topics": [
            "Attendees",
            "Avoid",
            "Balance",
            "But",
            "Enforce"
          ],
          "type": "workshop"
        },
        {
          "id": "session_012",
          "title": "API Security in Web3: Protecting Decentralized Applications from Common Threats",
          "description": "As decentralized applications (dApps) continue to gain adoption, the APIs powering them have become critical, and increasingly vulnerable. This session explores the unique security challenges of Web3 APIs and offers practical strategies for protecting them.\n\nWe'll dive into real-world attack vectors such as replay attacks, supply chain attack, smart contract exploits, API key leakage, and denial of service, and discuss how authentication mechanisms like OAuth2, JWT, and wallet-based auth (e.g., SIWE) can be adapted for decentralized contexts. You’ll also learn how to design APIs with security in mind from day one—balancing openness and access control in a trust-minimized environment.\n\nWhether you're building DeFi protocols, NFT marketplaces, or DAO tools, this talk will help you secure your Web3 APIs against emerging threats and build with confidence in a rapidly evolving landscape.",
          "speakers": [
            "194302b8-82f8-424e-8036-572a3382f349"
          ],
          "time": "13:30 - 13:40",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "DeFi",
            "Whether",
            "You"
          ],
          "type": "lightning"
        },
        {
          "id": "session_013",
          "title": "Next-Gen API as a Service: AI-Driven Delivery, Adaptive Documentation, and Seamless Integration",
          "description": "APIs are evolving beyond static endpoints into intelligent services that adapt to user needs. This session explores how AI can drive scalable, personalized API experiences, improve documentation delivery, and enable seamless integration into any tech stack. Discover how to transform APIs from mere technical components into user-centric products that fit effortlessly into diverse ecosystem",
          "speakers": [
            "91debd1d-e912-47d3-a19e-fa911c90b176"
          ],
          "time": "13:40 - 14:05",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Discover"
          ],
          "type": "session"
        },
        {
          "id": "session_014",
          "title": "Designing Seamless API Experiences: Integrating Product Design with API Innovation",
          "description": "This elaborates on how product designers and integration teams collaborate to create intuitive, secure, and scalable API experiences. This session highlights best practices, practical tools, and emerging trends to transform APIs from mere backend utilities into strategic enablers of innovative digital products.",
          "speakers": [
            "7cc2a99d-0355-477e-bc86-f4a58daf305d"
          ],
          "time": "13:40 - 14:05",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [],
          "type": "session"
        },
        {
          "id": "session_015",
          "title": "Monitoring your APIs like a SuperHero with the Kubernetes prometheus stack",
          "description": "In today’s increasingly containerized and microservices-oriented world, real-time observability and proactive monitoring are crucial for delivering resilient and high-performing APIs. In this session, we will explore how the Kube Prometheus Stack can serve as a powerful ally in maintaining the health of your services, ensuring you detect issues before they escalate. Attendees will learn the fundamentals of setting up Prometheus, configuring Alertmanager for intelligent notifications, and creating intuitive dashboards in Grafana—all within a Kubernetes environment.\n\nWe will walk through best practices for instrumenting APIs, showcasing how to collect and analyze metrics that matter most to your users and business. From troubleshooting performance bottlenecks to scaling your monitoring infrastructure, this talk will provide a comprehensive overview of how to leverage the full potential of the Kube Prometheus Stack. By the end of the session, participants will have the tools, insights, and confidence to monitor their APIs “like a superhero,” preventing minor hiccups from becoming major disruptions and keeping critical services running smoothly. ",
          "speakers": [
            "f4cdf876-e863-4dee-9b6a-0f047d4cab54"
          ],
          "time": "14:05 - 14:50",
          "room": "Ruby Hall",
          "level": "beginner",
          "topics": [
            "Alertmanager",
            "Attendees",
            "Grafana",
            "Kube",
            "Kubernetes"
          ],
          "type": "workshop"
        },
        {
          "id": "session_016",
          "title": "Server-Side Rendering with Dart: Building Dynamic Web Applications",
          "description": "Generally, dart as a language seems to have been popularized by the flutter framework and people don't think server side work when they think dart.\n\nIn this session, I'll share our journey building shortly, a high-performance URL shortener, using dart's server-side rendering capabilities. \n\nAttendees Will Gain hands-on experience with server-side rendering in Dart, techniques for creating maintainable template systems, performance optimisation strategies that actually work.\n\nWhether you're building a simple website or a complex web application, you'll walk away with actionable insights and practical skills you can immediately apply to your projects. \n\nJoin me to learn how server-side rendering with Dart can transform your web development experience.",
          "speakers": [
            "f60af971-bfc5-4735-8f27-68b71de0e2f8"
          ],
          "time": "14:05 - 14:50",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "Attendees",
            "Dart",
            "Gain",
            "Generally",
            "Join"
          ],
          "type": "workshop"
        },
        {
          "id": "session_017",
          "title": "AI-driven HATEOAS",
          "description": "HATEOAS stands for Hypermedia as the Engine of Application State. It's one of the small part of RESTful constraints for building self-descriptive and optimal experience APIs. However, most of the API providers forget to implement it in their APIs. In this talk, I will break down how to design and build HATEOAS-based APIs powered by AI that tracks users/developers behaviour of using an API and then help to navigating through the APIs for different endpoints.",
          "speakers": [
            "4c51cdc6-6365-46ca-bb7f-98ab8d1cd99b"
          ],
          "time": "14:50 - 15:15",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Application",
            "Engine",
            "However",
            "Hypermedia",
            "State"
          ],
          "type": "session"
        },
        {
          "id": "session_018",
          "title": "APIs Don’t Speak — Dashboards Do",
          "description": "APIs are the invisible powerhouses driving most digital interactions, but traditional monitoring often falls short when it comes to explaining why slowdowns or failures happen. In this session, I will explore how data professionals can create dashboards that provide a comprehensive view of API performance, going beyond just response codes.\n\nUsing Power BI, I will demonstrate how to visualise key metrics like latency spikes, call volume patterns, and performance bottlenecks in ways that resonate with engineers, product managers, and business stakeholders alike. This isn’t about eye-catching visuals, but it’s about building dashboards that enable teams to take action quickly, gain deeper insights, and work more efficiently.\n\nWhether you're in data, DevOps, or product management, this session will equip you with the tools to turn raw logs into impactful visual narratives that drive smarter decisions.",
          "speakers": [
            "2001a8b2-77e3-4a47-b38a-8401a2f9ff6a"
          ],
          "time": "14:50 - 15:15",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "DevOps",
            "Power",
            "Using",
            "Whether"
          ],
          "type": "session"
        },
        {
          "id": "session_019",
          "title": "Tested and Trusted : Building Testable APIs and Testing Testable APIs.",
          "description": "APIs are an essential part of how our world functions today. From AI agents calling API endpoints to book a game, to service accounts calling APIs endpoints to start a cron job, all that we interact with on the interweb is connected by APIs, and these will only become more important as we march towards a more connected future. In my 7+ years of experience building and testing APIs, I have discovered certain principles that make for a testable API. Seemingly basic things, like appropriate status codes and clear error messages, pagination and filtering, are the difference between a passable and a testable API. The goal of the workshop is to give people a hand-on guide in the creation of such testable APIs, and more importantly, how to test such APIs. The audience is developers, QA Engineers, SDETs and every stakeholder involved in API quality conversations.\n\nThank you for the opportunity, I look forward to hearing from you",
          "speakers": [
            "a14cb0ee-6680-4732-aac4-14e7e97a4b92"
          ],
          "time": "15:15 - 16:00",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "Engineers",
            "Seemingly",
            "Thank"
          ],
          "type": "workshop"
        },
        {
          "id": "session_020",
          "title": "From Vision to Execution: Building APIs as Scalable Products in Fintech",
          "description": "In the fast-paced world of fintech, building scalable APIs isn't just about exposing endpoints—it's about crafting products that can evolve with customer needs, regulatory expectations, and business growth.\n\nIn this talk, I (Solomon Olalemi), a seasoned technical product leader in Nigeria’s fintech ecosystem, will share practical product-led approach to designing and managing APIs as real, scalable products. Drawing from my multiple experiences across microfinance banking, digital banking, payment infrastructures, and cross-border payment platforms, Solomon will walk attendees through the following;\n\n1. How to go from a product vision to an API delivery roadmap.\n2. Techniques to align engineers, operations, compliance, and marketing teams.\n3. Designing APIs with business scalability and partner integrations in mind.\n4. Creating lifecycle plans for APIs: versioning, onboarding, feedback loops.\n5. Managing internal vs. external APIs and monetizing API platforms\n\nAttendees will leave with a framework for transforming API efforts from one-off projects into strategic, revenue-driving products—ready to serve thousands of users, partners, and ecosystems.\n\nWhether you're a product manager, API engineer, or startup founder, this session will equip you with the mindset, tools, and real-world insights to lead successful API-first initiatives in fintech and beyond.\n\n",
          "speakers": [
            "d17cd891-4144-431d-8775-1bf2f5484c12"
          ],
          "time": "15:15 - 16:00",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Attendees",
            "Creating",
            "Designing",
            "Drawing",
            "How"
          ],
          "type": "workshop"
        },
        {
          "id": "session_021",
          "title": "Designing Developer-Friendly APIs: A Frontend Engineer’s Wishlist",
          "description": "APIs are contracts—and the frontend is often the first to feel the pain when those contracts are hard to use, poorly documented, or constantly changing. In this talk, we’ll explore API design from a frontend developer’s point of view, highlighting what makes an API intuitive, reliable, and delightful to consume.\n\nDrawing from real-world experience building UIs across fintech, healthtech, and marketing platforms, I’ll share a practical \"wishlist\" of features, patterns, and practices frontend developers dream of—like predictable error handling, meaningful status codes, well-structured responses, clear documentation, and thoughtful versioning.\n\nWhether you build APIs or work closely with the teams that do, this session will leave you with actionable ideas to improve the developer experience (DX) of your APIs and make frontend integration a breeze.",
          "speakers": [
            "9b8ce9ae-2c3e-4d2e-9dd0-cb2d288a8c13"
          ],
          "time": "16:00 - 16:25",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "Drawing",
            "Whether"
          ],
          "type": "session"
        },
        {
          "id": "session_022",
          "title": "Banking Without Banks? Building Resilient Wallet Infrastructure in Unstable Times",
          "description": "In January 2021, Providus bank announced they were shutting down their virtual account service. This sent many  fintechs (piggyvest, risevest, etc) into a frenzy. \n\nThe engineering and business teams needed to find new providers, build new rails, connect the rails, test the connection, make the rails available in record time.\n\nHow were they able to do it?\n\nIn this talk, I will use a dummy fintech app (Akeke). I will describe the best-practice microservice architecture that makes it easy to turn off any API and connect to another in record time.\n \nThis talk breaks down how the right architecture decisions — microservices, abstraction layers, event queues, and modular APIs — allowed teams to pivot fast under pressure.\n\n",
          "speakers": [
            "2f3e3756-391e-4eab-94db-4284487c398f"
          ],
          "time": "16:00 - 16:25",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Akeke",
            "How",
            "January",
            "Providus"
          ],
          "type": "session"
        }
      ]
    },
    {
      "day": 2,
      "date": "July 19, 2025",
      "sessions": [
        {
          "id": "session_023",
          "title": "The API Mindset for Mass Innovation",
          "description": "In an era where speed, scalability, and openness define market leadership, APIs have evolved far beyond mere technical interfaces — they are strategic assets, collaboration tools, and innovation accelerators.\n\nThis keynote explores what it means to adopt an “API Mindset” — a philosophy that views every product, service, and organization as a platform that others can build upon. From internal teams to global ecosystems, the API mindset reshapes how we design products, share knowledge, structure teams, and scale ideas.\n\nWe’ll uncover:\n\n- How APIs enable modularity and reuse, unlocking velocity across industries\n- Why thinking like a platform company transforms not just tech, but culture and governance\n- How developer experience (DX) and agent experience (AX) are critical for innovation at scale\n- Real-world examples of organizations that grew by opening their boundaries and embracing composability\n- How to design not just APIs, but contracts of trust between humans, machines, and markets",
          "speakers": [
            "f2a22ec1-8eea-4122-bed1-64992e698324"
          ],
          "time": "09:30 - 09:45",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "How",
            "Mindset",
            "Real",
            "Why"
          ],
          "type": "keynote"
        },
        {
          "id": "session_024",
          "title": "DevOps Meets APIs: Building, Governing, & Scaling API-First Architectures for Enterprise Application",
          "description": "In this session, we'll explore how DevOps principles can be applied to the full lifecycle of API development — from design to deployment, governance to observability. Drawing from real-world enterprise experience, I’ll share how to build scalable API platforms, automate policy enforcement using CI/CD, and deliver a self-service developer experience.\n\nWe'll also cover how to optimize performance, ensure compliance, and manage internal APIs at scale, using modern DevOps tooling and strategies. Whether you're an API architect or DevOps leader, you'll leave with practical insights to build reliable, secure, and governed APIs that support fast-moving development teams.",
          "speakers": [
            "f17e3a8c-07cc-471d-8cc4-3b45739d42f8"
          ],
          "time": "09:45 - 10:00",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "DevOps",
            "Drawing",
            "Whether"
          ],
          "type": "keynote"
        },
        {
          "id": "session_025",
          "title": "Caching Strategies for High-Traffic APIs",
          "description": "I want to share insights on designing an effective caching layer for high-traffic APIs, drawing from my experience building the API that powers Treblle, an API observability platform handling 1 billion requests per month.\n\nIn this talk, I’ll cover:\n    - Choosing the right caching backend (Redis, Memcached, etc.)\n    - Optimal deployment strategies and hosting considerations\n    - Best practices to maximize performance and reliability\n\nThis session is geared towards intermediate developers looking to scale their APIs efficiently, with plenty of takeaways and a chance to exchange insights with senior engineers.",
          "speakers": [
            "e7c8681b-96d1-431d-bbd0-b9873adbf825"
          ],
          "time": "10:00 - 10:10",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Best",
            "Choosing",
            "Memcached",
            "Optimal",
            "Redis"
          ],
          "type": "lightning"
        },
        {
          "id": "session_026",
          "title": "Embedded Insurance in 5 Minutes",
          "description": "During my session, I will be talking about the economics of using APIs, the true cost of using APIs and things to look out for when choosing an API company.",
          "speakers": [
            "c9ee0781-12f0-46e7-ab61-829d4cb71518"
          ],
          "time": "10:10 - 10:20",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "During"
          ],
          "type": "lightning"
        },
        {
          "id": "session_027",
          "title": "Mycover.ai : API innovation in action",
          "description": "MyCover AI demo walkthrough",
          "speakers": [
            "526387c1-8681-478c-8ea5-03ba74ca8e1f"
          ],
          "time": "10:20 - 10:30",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "MyCover"
          ],
          "type": "lightning"
        },
        {
          "id": "session_028",
          "title": "Building Resilient Microservice APIs: Engineering for High-Stakes Environments",
          "description": "In mission-critical environments where downtime directly impacts revenue and user trust, building resilient APIs requires more than just theoretical best practices. This session provides a practical, experience-based framework for designing microservice APIs that maintain stability even when facing unpredictable traffic patterns, infrastructure failures, and integration challenges.\nDrawing from real-world implementation experiences in the financial technology sector, this talk will walk through the evolution of resilience patterns across different scaling phases. Attendees will learn concrete strategies for implementing circuit breakers, rate limiters, and graceful degradation mechanisms in Node.js environments, along with monitoring approaches that provide actionable insights during system stress.",
          "speakers": [
            "3c9be750-4386-4dd6-a0cb-ec5cc9fbd496"
          ],
          "time": "10:30 - 10:55",
          "room": "Amber Hall",
          "level": "intermediate",
          "topics": [
            "Attendees",
            "Drawing",
            "Node"
          ],
          "type": "session"
        },
        {
          "id": "session_029",
          "title": "Redis in Action: From Simple Cache to Advanced Queues and Streams",
          "description": "Redis is more than just a cache—it’s a powerful data structure server that can handle event-driven architectures like real-time messaging, and background job processing. In this talk, we’ll explore how Redis goes beyond basic key-value storage and how to leverage it for queues and streams.",
          "speakers": [
            "fdc854fb-557e-4516-9b08-9f599827edbc"
          ],
          "time": "10:30 - 10:55",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Redis"
          ],
          "type": "session"
        },
        {
          "id": "session_030",
          "title": "From Chaos to Clarity: Building API Integrations That Don’t Burn Out Your Team or Product",
          "description": "Situation (Context)\nModern digital products thrive on ecosystems of APIs — from payments and identity to logistics, HR, and messaging. Building with multiple third-party services is no longer a luxury; it’s the foundation of reliability and scale in today’s software.\n\nComplication (Problem)\nThings spiral quickly when your product needs to integrate with multiple providers, each with different data models, error behaviors, rate limits, and webhook implementation. Inconsistent standards, flaky responses, silent failures, and ever-changing specifications turn your codebase into a brittle mess. The product and engineering team end up spending more time firefighting integrations than building product value.\n\nQuestion\nHow can engineering teams build robust, scalable, and maintainable multi-provider API integrations without exhausting their developers or compromising product stability?\n\nAnswer (The Talk)\nIn this talk, I’ll walk through a proven playbook developed from integrating with nearly every major fintech provider in Nigeria, including payment providers, banks, switches, and how those principles apply across industries and verticals. Attendees will learn:\n\nDesign principles for integration layers that normalize and abstract provider differences\n\nPractical fallback strategies and retry patterns that make flaky APIs survivable\n\nArchitecture approaches that support seamless provider switching or multi-provider orchestration\n\nObservability techniques and tooling that reduce integration-related burnout\n\nHow to avoid common anti-patterns in webhook handling, authentication flows, and versioning\n\nAttendees will leave with concrete strategies for building multi-provider API integrations that scale with their product and preserve team sanity in the process.",
          "speakers": [
            "85dcb8b2-73e1-4093-b5c3-a5907d11a195"
          ],
          "time": "10:30 - 10:55",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "Answer",
            "Architecture",
            "Attendees",
            "Building",
            "Complication"
          ],
          "type": "session"
        },
        {
          "id": "session_031",
          "title": "Beyond API Keys: Advanced Strategies for Securing Mobile API Integrations",
          "description": "API security in mobile applications goes far beyond hiding API keys. Attackers can decompile apps, intercept network requests, and exploit vulnerabilities if security measures aren’t robust. This session explores advanced techniques for securing API integrations in mobile apps, including dynamic API key management, OAuth 2.0 best practices, mutual TLS authentication, certificate pinning, AES encryption for sensitive data, and runtime application self-protection (RASP). We’ll also discuss strategies to mitigate threats such as API abuse, unauthorized access, and reverse engineering.\n\nAttendees will walk away with practical strategies to implement resilient, secure, and attack-resistant API architectures for mobile applications.",
          "speakers": [
            "cb17af7d-78b2-44b9-b43f-cee228945054"
          ],
          "time": "11:20 - 11:45",
          "room": "Amber Hall",
          "level": "advanced",
          "topics": [
            "Attackers",
            "Attendees"
          ],
          "type": "session"
        },
        {
          "id": "session_032",
          "title": "Detecting threats and anomalies in API traffic with AI models.",
          "description": "API security is a major concern, and adding AI makes it very current.",
          "speakers": [
            "d6c8a7c0-e3a4-4c3b-b15a-317238b16c2a"
          ],
          "time": "11:20 - 11:45",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [],
          "type": "session"
        },
        {
          "id": "session_033",
          "title": "Detecting the Undetectable: Applying Merkle Trees and LLMs to Software Monitoring",
          "description": "In 2019, Anthony Alaribe led a legacy service rewrite at Delivery Hero that went disastrously wrong when a single, overlooked field caused nearly $2 million in lost orders. \n\nDetermined to prevent such Incidents, Anthony dug into why these elusive bugs are so hard to detect automatically. In this retrospective and code dive, he shows how cryptographic techniques and LLM-powered analysis of logs and request payloads can reveal and track breaking changes once thought impossible to catch. \n\nExpect a practical, story-driven session that walks you through the intuition—and the code—behind building a system to safeguard your software from similar costly surprises.",
          "speakers": [
            "7dcc706d-900b-40c4-b42f-b30121752d8d"
          ],
          "time": "11:20 - 11:45",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Alaribe",
            "Anthony",
            "Delivery",
            "Determined",
            "Expect"
          ],
          "type": "session"
        },
        {
          "id": "session_034",
          "title": "Leveraging Subgraph APIs for Real-Time Blockchain Data",
          "description": "In the evolving Web3 ecosystem, efficient data access is crucial for decentralized applications (dApps). Subgraph APIs provide a powerful solution for indexing and querying blockchain data, enabling developers to build highly responsive, real-time user interfaces.\n\nIn this hands-on Workshop, attendees will learn how to:\n- Set up a Subgraph API to index blockchain data\n- Query blockchain events using GraphQL\n- How to build real-time dashboards for dApps using Next.js\n- Best practices for efficiently consuming Blockchain APIs\n\nBy the end of this session, developers will have built a live Web3 dashboard that fetches, displays, and updates blockchain data in real-time.\n\nWho Should Attend?\n- Frontend & Full-Stack Developers building blockchain-integrated applications\n- Web3 Developers interested in efficient data querying\n- API Enthusiasts exploring GraphQL for blockchain data\n\nWhy This Talk?\nWeb3 developers often struggle with slow, inefficient on-chain data access. This session bridges the gap by teaching them how to use Subgraph APIs effectively to build scalable, high-performance Web3 applications.\n\nAgenda\n1. Introduction to Subgraph APIs - Why indexing matters in Web3\n2. Setting Up a Subgraph - Deploying on Blockchain Networks using The Graph\n3. GraphQL Basics - Querying blockchain transactions & smart contracts\n4. Building a Frontend UI - Connecting a Next.js app to a Subgraph API\n5. Rendering Real-Time Data - Fetching transfers, wallets & analytics\n6. Optimizing for Performance - Using polling, subscriptions & caching\n7. Wrap-up & Q/A",
          "speakers": [
            "e96b5855-1d51-4874-96a0-e43fe17f205b"
          ],
          "time": "11:45 - 12:30",
          "room": "Amber Hall",
          "level": "beginner",
          "topics": [
            "Agenda",
            "Attend",
            "Basics",
            "Best",
            "Blockchain"
          ],
          "type": "workshop"
        },
        {
          "id": "session_035",
          "title": "Powering Payments with ALATPay: Tools, APIs, and SDKs for Engineers",
          "description": "",
          "speakers": [
            "3496254e-96f0-4595-af71-bd7c70b88af3"
          ],
          "time": "11:45 - 12:30",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [],
          "type": "workshop"
        },
        {
          "id": "session_036",
          "title": "How Machines See:Build a product image search backend with Vision API Product Search",
          "description": "How Machines See:Build a product image search backend with Vision API Product Search \n\nhttps://developers.google.com/codelabs/build-product-search-backend#0 ",
          "speakers": [
            "59a7c9d1-0743-41a3-8c8f-142b72fce3ee"
          ],
          "time": "11:45 - 12:30",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Build",
            "How",
            "Machines",
            "Product",
            "Search"
          ],
          "type": "workshop"
        },
        {
          "id": "session_037",
          "title": "How we monitor and maintain over 40 third party integrations at involve.me",
          "description": "This is a deep walk-through of how we monitor and maintain a lot of third-party integrations at involve.me that enables the AI-powered platform to help businesses turn website traffic into qualified leads. ",
          "speakers": [
            "fa429da3-63eb-4513-b41b-2863aa5e9d6f"
          ],
          "time": "13:30 - 13:40",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [],
          "type": "lightning"
        },
        {
          "id": "session_038",
          "title": "The Art and Science of Lovable API Documentation: Lessons from the Monnify Revamp",
          "description": "Tired of developers struggling with your API documentation? Let's fix that! This session is a practical guide to creating API documentation that developers love to use. We'll cover actionable strategies for writing clear and concise content, structuring information for easy navigation, and incorporating interactive examples that bring your API to life. Learn how to leverage tools and techniques to improve the developer experience and build a thriving community around your API. Based on real-world experience and the successful revamp of Monnify's developer documentation, this talk will provide you with the tools and knowledge you need to create documentation that delights.\n\nWhether you're a seasoned API architect or a developer just starting out, you'll gain valuable insights to transform your documentation from a necessary evil to a powerful and loved resource.",
          "speakers": [
            "c81edb61-7959-4bf2-975a-380e1d0ea411"
          ],
          "time": "13:40 - 14:05",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "Based",
            "Learn",
            "Let",
            "Monnify",
            "Tired"
          ],
          "type": "session"
        },
        {
          "id": "session_039",
          "title": "API-Driven Innovation: MyCover.ai’s Blueprint for Modernizing Insurance Ecosystems",
          "description": "In an era where digital transformation is reshaping industries, the insurance sector is no exception. APIs (Application Programming Interfaces) have emerged as the backbone of innovation, enabling seamless integration, automation, and scalability. In this session, I will explore how MyCover.ai is leveraging API-driven solutions to modernize Africa’s insurance ecosystem—breaking down legacy barriers, enhancing customer experiences, and unlocking new business models.\n\nFrom frictionless policy issuance to real-time claims processing, discover how MyCover.ai’s API framework is empowering insurers, brokers, and fintech partners to operate with agility and efficiency. We’ll dive into real-world use cases, the challenges of digital adoption in emerging markets, and the future of insurance as an embedded, customer-centric service. The audience will learn how APIs aren’t just tools, but strategic assets for building the next generation of inclusive, tech-powered insurance.\"\n\nKey Takeaways:\n\nThe role of APIs in accelerating insurtech innovation.\n\nHow MyCover.ai bridges gaps between traditional insurers and digital ecosystems.\n\nPractical insights on scalability, partnerships, and customer-centric design.\n\nThe future of embedded insurance in Africa and beyond.",
          "speakers": [
            "dec7b594-bd29-4e72-b1a1-97fe4f73d051"
          ],
          "time": "13:40 - 14:05",
          "room": "Amber Hall",
          "level": "intermediate",
          "topics": [
            "Africa",
            "Application",
            "How",
            "Interfaces",
            "Key"
          ],
          "type": "session"
        },
        {
          "id": "session_040",
          "title": "Scaling Payroll Across Africa",
          "description": "Payroll is very central to work. Scaling anything is quite hard. Scaling across different markets is a lot of work. In this talk, I will be discussing lessons, challenges and ideas in which payment for workers can be scaled.\n\nIn 2024, Africa is estimated to have around 1.48 billion people. Among these, there are about 482 million who are employed, and they need to be paid regularly.\n(monthly, weekly, annually etc).\n\n5 Personal Lessons I have learnt with Scaling Payroll\n\n1. Correctness Over Speed: Accuracy in calculations trumps rushing payments\nto avoid costly errors.\n2. Timely Payments Build Trust: Paying salaries on time enhances your\ncompany’s reputation.\n3. ERP Giants Are Skeptical: Big firms using Sage or Oracle are slow to trust new\nsolutions and may undervalue your service.\n4. Embrace Customizations: Tailored solutions are expected—use them to differentiate your offering.\n5. It’s PAAS, Not SAAS: Payroll-as-a-Service means owning the client’s process,\nnot just providing software.\n6. Shady Practices. Not necessarily illegal, more like skewed interpretations of\nthe laws.\n\nChallenges\n1. Same-Day Payments Vary: Not all markets support instant transfers due to\nbanking limitations.\n2. Changing Regulations: Tax, disability, and labor laws evolve frequently across\ncountries.\n3. Local Nuances: Payroll calculations differ (e.g., Nigeria vs. Ethiopia).\n4. Multi-Currency Payments: Integrating with local payment bodies for diverse\ncurrencies is slow.\n5. Compliance Complexity: Ensuring adherence to local laws across markets.\n6. Customization Overload: Client-specific demands can strain resources.\n7. Expatriate Payments: Managing foreign employees adds regulatory and\ncurrency challenges.\n8. Shady Employees: Always scan code base for strange manipulations.\n\nSolutions\n1. APIs, APIs, APIs. You would need to integrate with local solutions, this might\nbe the fastest way instead of building and scaling\n2. Monitor compliance and changing laws and respond quickly.\n3. Speed Matters. Optimize your code to process faster\n4. Have guardrails in your code and processes to prevent wrong payments from\ngoing out.\n\n",
          "speakers": [
            "553171d5-c8b7-4512-8d5b-1c275d79f588"
          ],
          "time": "13:40 - 14:05",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Accuracy",
            "Africa",
            "Always",
            "Among",
            "Are"
          ],
          "type": "session"
        },
        {
          "id": "session_041",
          "title": "How to design API Documentation that Technical & Non-technical Audience love",
          "description": "Great API documentation is more than just reference material—it’s a bridge between developers, product managers, and business stakeholders. In this session, we’ll explore best practices for designing API documentation that caters to both technical and non-technical users. You’ll learn how to balance clarity with depth, structure content for different user needs, and incorporate visuals, tutorials, and interactive tools that enhance comprehension. We’ll also discuss common pitfalls, accessibility considerations, and how to leverage AI for dynamic documentation. Whether you're writing docs for developers, decision-makers, or end-users, this session will equip you with the tools to create documentation that is clear, engaging, and user-friendly.\n\nWho Should Attend?\n- Engineers responsible for documentation\n- Technical writers and content strategists\n- Product managers bridging technical and non-technical teams\n- UX designers focused on developer experience (DX)\n- Customer support and developer relations professionals",
          "speakers": [
            "600e4993-8228-47cf-a195-450293dbb54f"
          ],
          "time": "15:15 - 15:40",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "Attend",
            "Customer",
            "Engineers",
            "Great",
            "Product"
          ],
          "type": "session"
        },
        {
          "id": "session_042",
          "title": "Mastering APIs as a Product Manager – Calling, Documenting, and Testing APIs",
          "description": "\nAPI literacy is important for all Product Managers, not just those building API-based products. While understanding APIs conceptually is useful, getting hands-on experience is just as crucial.  \n\nThis practical workshop will help Product Managers learn how to interact with APIs, write clear documentation, and test API reliability—all without needing a technical background. By the end of the session, attendees will feel more confident working with APIs and collaborating with developers.  \n\nKey Takeaways of Workshop for PMs\n- Understand how to work with APIs—even without coding experience.  \n- Learn to write and review API documentation that developers can use easily.  \n- Ensure API reliability by testing and catching issues early.  \n- Communicate more effectively with engineers about API functionality and challenges.  \n",
          "speakers": [
            "da62c675-f62e-45a9-963d-9c12180670cc"
          ],
          "time": "15:15 - 15:40",
          "room": "Amber Hall",
          "level": "intermediate",
          "topics": [
            "Communicate",
            "Ensure",
            "Key",
            "Learn",
            "Managers"
          ],
          "type": "session"
        },
        {
          "id": "session_043",
          "title": "Shaping the future of semiconductor manufacturing with GenAI",
          "description": "Generative Artificial Intelligence is revolutionizing industrial decision-making by providing powerful new tools for complex problem-solving and data analysis. Technologies like Retrieval-Augmented Generation (RAG) and specialized models like Big GCVAE (Generalized-Controllable Variational AutoEncoder) are transforming how industries approach critical tasks such as failure analysis in semiconductor manufacturing.\n\nThese AI systems excel at processing vast amounts of technical documentation and historical data to generate informed recommendations that closely mimic expert decision-making. By implementing context-aware RAG with asynchronous vector database searches, industries can achieve not only higher accuracy but also significant reductions in energy consumption, CO2 emissions, and operational costs compared to traditional approaches.\n\nThe advantages extend beyond just efficiency. These systems enable companies to maintain institutional knowledge, reduce reliance on specialized expertise for routine decisions, and scale decision-making capabilities across complex operations. In sectors like energy, manufacturing, and semiconductors, where equipment failures can result in substantial losses, AI-powered decision support systems provide faster and more accurate root cause analysis.",
          "speakers": [
            "cddbe480-9df3-47b1-8f7c-b8194aa48a67"
          ],
          "time": "15:15 - 15:40",
          "room": "Ruby Hall",
          "level": "advanced",
          "topics": [
            "Artificial",
            "Augmented",
            "AutoEncoder",
            "Big",
            "Controllable"
          ],
          "type": "session"
        },
        {
          "id": "session_044",
          "title": "Refactoring Legacy APIs with Domain-Driven Architecture",
          "description": "Overview\nMany companies struggle with legacy APIs that are difficult to maintain, scale, or extend. They’re often tangled with business logic, hard to test, and resistant to change. This talk will focus on how Domain-Driven Architecture (DDA) helps untangle these systems by bringing clarity, modularity, and better domain modeling.\n\nWho This Is For\nThis session is for software engineers or architects who work with legacy APIs and want a structured way to refactor them. If you’re dealing with monolithic APIs, struggling with unclear business logic, or planning to migrate to microservices, this talk will give you practical insights.\n\nWhat I will Cover in this talk\n- Identifying problems in legacy APIs that make them hard to maintain.\n- Key DDA concepts that help in refactoring (bounded contexts, aggregates, domain events).\n- A step-by-step approach to breaking down and refactoring an API without breaking existing consumers.\n- Real-world examples of refactoring APIs using DDA principles.\n\nWhat I Won’t Cover\n- A deep dive into specific frameworks or programming languages. The focus is on principles, not tools.\n- A complete rewrite strategy. This talk is about refactoring, not replacing your entire API.\n",
          "speakers": [
            "dc5f8d48-00af-4d42-b62f-aed06a3ae23f"
          ],
          "time": "15:40 - 16:05",
          "room": "Ruby Hall",
          "level": "advanced",
          "topics": [
            "Architecture",
            "Cover",
            "Domain",
            "Driven",
            "Identifying"
          ],
          "type": "session"
        },
        {
          "id": "session_045",
          "title": "Microservices Architecture 101: Principles and Best Practices",
          "description": "Context:\n\nAs a former software developer, now leading product manager, i have always been technical, and I have had to opportunity to experience this from both a \"developer\" and a \"products\" perspective. \n\nCurrently, I lead and manage one of the best indigenously built core banking platforms, Nerve at Kuda, one of Africa's biggest digital banks, and its being quite a ride.\n\nGuess what, Nerve as a complete system is made up of many powerful individual microservices working together to create magic. I have seen firsthand the power of complex systems powered and run by fine microservices. \n\nThis has informed my topic selection - Microservices Architecture: Principles and Best Practices. \n\nSynopsis:\n\nIn this session, I will  explore the fundamental concepts of microservices architecture, emphasizing its increased signficance in technical products development today. I would be highlighting the advantages of adopting microservices over monolithic architectures, while discussing key principles that guide effective microservices design. Finally, I will outline best practices for building and implementing a robust microservices architecture including the use of an API gateway. \n\nBy the end of the session, attendees will gain valuable insights into why microservices are important, and how they can transform and enhance agility, scalability, and maintainability in software systems. \n\nThank you",
          "speakers": [
            "d189d5d5-587c-416a-98ed-0a45c2fb786e"
          ],
          "time": "15:40 - 16:05",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "Africa",
            "Architecture",
            "Best",
            "Context",
            "Currently"
          ],
          "type": "session"
        },
        {
          "id": "session_046",
          "title": "Dart on the Server: Unlocking Full-Stack Potential",
          "description": "Looking for a modern, efficient language for your next API project? This session spotlights Dart as a powerful yet underutilized server-side language that delivers exceptional performance and developer experience for API development.\n\nDiscover how Dart's built-in async/await, strong typing, and robust standard library make it uniquely suited for creating reliable, maintainable APIs. We'll explore practical implementations using server frameworks like Shelf, demonstrate effective patterns for structuring API endpoints, and showcase how Dart's inherent strengths address common API development challenges.\n\nYou'll learn how Dart enables rapid development cycles while maintaining type safety, see real-world examples of REST  implementations, and understand deployment strategies for production environments. Whether you're a backend engineer evaluating new technologies or an API architect seeking productivity gains, this talk provides valuable insights into how Dart can enhance your server-side development toolkit.",
          "speakers": [
            "6dd24965-b464-41b5-9901-037ff123c449"
          ],
          "time": "15:40 - 16:05",
          "room": "Amber Hall",
          "level": "intermediate",
          "topics": [
            "Dart",
            "Discover",
            "Looking",
            "Shelf",
            "Whether"
          ],
          "type": "session"
        },
        {
          "id": "session_047",
          "title": "API-first DevOps: Automating API deployments for speed and scale",
          "description": "APIs are at the heart of modern applications, but deploying and managing them can get messy fast. In this session, we’ll talk about how an API-first approach can make DevOps smoother, cutting down on manual work and helping teams ship faster with fewer headaches. We’ll cover practical ways to automate deployments, integrate CI/CD, and scale APIs effortlessly.",
          "speakers": [
            "1ea46088-c4a4-464f-9220-9876901031ac"
          ],
          "time": "16:05 - 16:30",
          "room": "Emerald Hall",
          "level": "intermediate",
          "topics": [
            "DevOps"
          ],
          "type": "session"
        },
        {
          "id": "session_048",
          "title": "Securing The Fort: API Gateway Architectures, and why they matter",
          "description": "Abstract:\nWhen building distributed systems, choosing the right API gateway architecture becomes critical for performance, security, and operational simplicity. In this session, we focus on the several patterns used to achieve this goal, focusing on Edge gateways (Nginx, Envoy, Traefik, etc). We’ll look at what they bring to the table, benchmark request latency, throughput, and resilience under load using a simple load tester with a Prometheus monitoring setup. We would also look into the sidecar architecture and when to use each pattern.]\n\nKey Takeaways:\n - Performance trade-offs: Measured latency & resource overhead for edge vs. sidecar.\n- Security patterns: Implementing TLS termination, mutual-TLS, \nand zero-trust in each model.\n- Operational impacts: Simplifying policy changes, versioning, and scaling.\n- Deployment recipes: Step-by-step for Envoy at the edge, Istio sidecars, and CI/CD integration.\n\nThe session concludes with integrating this architecture with Kubernetes. Then we have a quick look at use cases: Uber, Netflix, and Amazon’s use of API gateways to serve their customers. \n",
          "speakers": [
            "3d37c86a-d735-435a-9ebc-8644628cf828"
          ],
          "time": "16:05 - 16:30",
          "room": "Ruby Hall",
          "level": "intermediate",
          "topics": [
            "Abstract",
            "Amazon",
            "Deployment",
            "Edge",
            "Envoy"
          ],
          "type": "session"
        },
        {
          "id": "session_049",
          "title": "Don’t Ask Me for Coffee — I’m a Teapot!",
          "description": "HTTP 404? Classic. 500? We’ve all been there. But 418 — I’m a teapot? What started as a 1998 April Fools’ joke became a cult classic among developers, sparking debates, memes, and even a resistance movement when someone tried to delete it.\n\nIn this lightning-fast, laugh-filled talk, we’ll uncover the quirky history of HTTP 418, its unexpected rise to fame, and why a “forbidden” teapot still holds a warm spot in the hearts of coders everywhere. You’ll leave with a smile — and maybe a new favorite status code.",
          "speakers": [
            "b0a0d0ff-0edd-47ea-9cee-f09f41f22cb8"
          ],
          "time": "16:05 - 16:30",
          "room": "Amber Hall",
          "level": "intermediate",
          "topics": [
            "April",
            "But",
            "Classic",
            "Fools",
            "What"
          ],
          "type": "session"
        }
      ]
    }
  ]
}